# (1)
勉強時間 <- c(1,3,10,12,6,3,8,4,1,5)
定期試験の得点 <- c(20,40,100,80,50,50,70,50,10,60)

plot(勉強時間, 定期試験の得点)

# (2)
cor(勉強時間, 定期試験の得点)

勉強時間の標準偏差 <- sqrt(sum((勉強時間 - mean(勉強時間)) ^ 2) / length(勉強時間))
定期試験の得点の標準偏差 <- sqrt(sum((定期試験の得点 - mean(定期試験の得点)) ^ 2) / length(定期試験の得点))
勉強と得点の共分散 <- sum((勉強時間 - mean(勉強時間)) * (定期試験の得点 - mean(定期試験の得点))) / length(勉強時間)
勉強と得点の相関係数 <- 勉強と得点の共分散 / (勉強時間の標準偏差 * 定期試験の得点の標準偏差)

# (3)
洋食派か和食派か <- c("洋食","和食","和食","洋食","和食","洋食","洋食","和食","洋食","洋食","和食","洋食","和食","洋食","和食","和食","洋食","洋食","和食","和食")
table(洋食派か和食派か)
甘党化か辛党か <- c("甘党","辛党","甘党","甘党","辛党","辛党","辛党","辛党","甘党","甘党","甘党","甘党","辛党","辛党","甘党","辛党","辛党","甘党","辛党","辛党")
table(甘党化か辛党か)

table(洋食派か和食派か, 甘党化か辛党か)

# (4)
洋食和食イチゼロ <- ifelse("洋食" == 洋食派か和食派か, 1, 0)
甘党辛党イチゼロ <- ifelse("甘党" == 甘党化か辛党か, 1, 0)

cor(洋食和食イチゼロ, 甘党辛党イチゼロ)
